
const properties = [
    {
        id: '1',
		offer: 'للبيع',
        name: 'منزل للبيع في بوعامر ورقلة',
        type: 'منزل',
        city: 'بوعامر',
        price: '450 عطاو',
        area: '180 م²',
		document: 'عقد عرفي',
        bedrooms: 3,
        bathrooms: 2,
        description: '▪️ السعر: عطاوه 450 مليون (4,500,000 دج)نوع العقار: منزل أرضي + سطح ▪️ المساحة: 180 م² (12م × 15م) ▪️ الموقع: حي بوعامر، ولاية ورقلة ▪️ الوثائق: عقد عرفي معترف به + فايت عليه المسح 📦 مكونات المنزل: • 3 غرف نوم • مطبخ • هول • حوش واسع • سطح  التجهيزات: كهرباء و غاز طبيعي ✅ ماء صالح للشرب',
        images: [
            'https://i.postimg.cc/HnxRbsqp/527706801-122162566742538390-3886313724909715863-n.jpg',
            'https://i.postimg.cc/vZ3PtdvT/524853825-122162566712538390-2687180683434997486-n.jpg',
			'https://i.postimg.cc/Bb9NnZJY/524986938-122162566736538390-6276878549806994982-n.jpg',
			'https://i.postimg.cc/3r1nTTPB/525787457-122162566748538390-6652176448620093205-n.jpg',
			'https://i.postimg.cc/Fs1gXJbr/525922369-122162566670538390-6216241120793083417-n.jpg',
			'https://i.postimg.cc/rpTrsd4t/525949505-122162566730538390-1808509065256217593-n.jpg'
        ],
        location: 'حي بوعامر ورقلة',
        featured: false,
        ownerPhone: '+213663420347'
    },
	{
    id: '2',
    offer: 'للإيجار',
    name: 'شقة مجهزة للكراء لمدة سنة الخفجي',
    type: 'شقة',
    city: 'الخفجي',
    price: '85000 / شهريا',
    area: 'غير محددة',
    document: 'للكراء',
    bedrooms: 4,
    bathrooms: 1,
    description: 'شقة مجهزة للكراء لمدة سنة في ورقلة الطابق الرابع – أربع نجوم 🌟🌟🌟🌟 الموقع: الخفجي▪️ المواصفات: غرف نوم فسيحة، مطبخ مجهز بالكامل، حمام أنيق، ويفي عالي السرعة، مكيف عالي الجودة، فريجيدار، ماشينة ملابس. مثالية للعائلات أو المقيمين لفترة طويلة',
    images: [
        'https://i.postimg.cc/Z522JdL4/IMG-20250808-191212.jpg',
        'https://i.postimg.cc/YChTc3Yd/IMG-20250808-191233.jpg',
        'https://i.postimg.cc/T1fBZvJb/IMG-20250808-191253.jpg',
        'https://i.postimg.cc/Wz8xVY5H/IMG-20250808-191306.jpg',
        'https://i.postimg.cc/3rFs2W3F/IMG-20250808-191319.jpg',
        'https://i.postimg.cc/HsWfzHxD/IMG-20250808-191335.jpg',
        'https://i.postimg.cc/cHqpBnKX/IMG-20250810-184602.jpg'
    ],
    location: 'الخفجي 38 ورقلة',
    featured: false,
    ownerPhone: '+213666059583'
},
	{
    id: '3',
    offer: 'للبيع',
    name: 'منزل للبيع في سعيد عتبة',
    type: 'منزل',
    city: 'سعيد عتبة',
    price: '800 عطاو 700 والبيع قريب',
    area: '14م × 17م',
    document: 'عقد ملكية',
    bedrooms: 4,
    bathrooms: 2,
    description: '▪️ السعر: 800 عطاو 700 والبيع قريب ▪️ نوع العقار: منزل + قراج + حوش فيه نخلات ▪️ المساحة: 14م × 17م ▪️ الموقع: سعيد عتبة، ولاية ورقلة ▪️ الوثائق: عقد ملكية 📦 مكونات المنزل: • 4 غرف نوم • صالة • حوش واسع • قراج • خاصاتو فينيسيو',
    images: [
        'https://i.postimg.cc/XqHTzbMX/inbound2414151657360193587.jpg',
        'https://i.postimg.cc/pXyNnp8j/inbound4824391404964592563.jpg',
        'https://i.postimg.cc/kXH0NqFp/inbound8121804677791027239.jpg',
        'https://i.postimg.cc/dVTz4p5t/inbound8903199671399561353.jpg'
    ],
    location: 'سعيد عتبة ورقلة',
    featured: false,
    ownerPhone: '+213664818333'
},
    {
        id: '4',
		offer: 'للبيع',
        name: 'أرض سكنية للبيع',
        type: 'أرض',
        city: 'بامنديل',
        price: '300 دج',
        area: '192 متر مربع',
		document: 'عقد ملكية',
        bedrooms: 0,
        bathrooms: 0,
        description: 'المساحة: 192 مترالموقع: موقع استراتيجي هادئ ومناسب للسكن، قريبة جدًا من المسجد والمحلات التجارية الوثائق: عقد ملكية الفاص: 3 📌 موقع الأرض يجعلها مثالية لبناء منزل عائلي أو استثمار طويل المدى.📞 للاستفسار والتواصل مباشرة:0699908764',
        images: [
            'https://i.postimg.cc/wTZvJqT4/photo-2025-08-04-14-17-39.jpg',
			'https://i.postimg.cc/Zn1x1k4b/photo-2025-08-04-14-17-41.jpg',
			'https://i.postimg.cc/SjFcgWfj/photo-2025-08-04-14-17-38.jpg',
            'https://i.postimg.cc/GmDpxW4L/photo-2025-08-04-14-17-35.jpg'
        ],
        location: 'حي بامنديل',
        featured: true,
		ownerPhone: '+213540076713'
    }
];

// Categories data
const categories = [
    { id: 'apartment', name: 'شقق', icon: '🏠', count: 3 },
    { id: 'villa', name: 'فيلات', icon: '🏡', count: 3 },
    { id: 'shop', name: 'محلات', icon: '🏪', count: 1 },
    { id: 'land', name: 'أراضي', icon: '🌍', count: 2 },
    { id: 'office', name: 'مكاتب', icon: '🏢', count: 1 }
];

function trackViewProperty(property) {
  gtag('event', 'view_property', {
    property_id: property.id,
    type: property.type,
    city: property.city,
    price: property.price
  });
}

function trackAddToFavorites(property) {
  gtag('event', 'add_to_favorites', {
    property_id: property.id,
    city: property.city
  });
}




