
const properties = [
    {
        id: '1',
		offer: 'للبيع',
        name: 'منزل للبيع في بوعامر ورقلة',
        type: 'منزل',
        city: 'بوعامر',
        price: '450 عطاو',
        area: '180 م²',
		document: 'عقد عرفي',
        bedrooms: 3,
        bathrooms: 2,
        description: '▪️ السعر: عطاوه 450 مليون (4,500,000 دج)نوع العقار: منزل أرضي + سطح ▪️ المساحة: 180 م² (12م × 15م) ▪️ الموقع: حي بوعامر، ولاية ورقلة ▪️ الوثائق: عقد عرفي معترف به + فايت عليه المسح 📦 مكونات المنزل: • 3 غرف نوم • مطبخ • هول • حوش واسع • سطح  التجهيزات: كهرباء و غاز طبيعي ✅ ماء صالح للشرب',
        images: [
            'https://i.postimg.cc/HnxRbsqp/527706801-122162566742538390-3886313724909715863-n.jpg',
            'https://i.postimg.cc/vZ3PtdvT/524853825-122162566712538390-2687180683434997486-n.jpg',
			'https://i.postimg.cc/Bb9NnZJY/524986938-122162566736538390-6276878549806994982-n.jpg',
			'https://i.postimg.cc/3r1nTTPB/525787457-122162566748538390-6652176448620093205-n.jpg',
			'https://i.postimg.cc/Fs1gXJbr/525922369-122162566670538390-6216241120793083417-n.jpg',
			'https://i.postimg.cc/rpTrsd4t/525949505-122162566730538390-1808509065256217593-n.jpg'
        ],
        location: 'حي بوعامر ورقلة',
        featured: false,
        ownerPhone: '+213663420347'
    },
	{
    id: '2',
    offer: 'للإيجار',
    name: 'شقة مجهزة للكراء لمدة سنة الخفجي',
    type: 'شقة',
    city: 'الخفجي',
    price: '85000 / شهريا',
    area: 'غير محددة',
    document: 'للكراء',
    bedrooms: 4,
    bathrooms: 1,
    description: 'شقة مجهزة للكراء لمدة سنة في ورقلة الطابق الرابع – أربع نجوم 🌟🌟🌟🌟 الموقع: الخفجي▪️ المواصفات: غرف نوم فسيحة، مطبخ مجهز بالكامل، حمام أنيق، ويفي عالي السرعة، مكيف عالي الجودة، فريجيدار، ماشينة ملابس. مثالية للعائلات أو المقيمين لفترة طويلة',
    images: [
        'https://i.postimg.cc/Z522JdL4/IMG-20250808-191212.jpg',
        'https://i.postimg.cc/YChTc3Yd/IMG-20250808-191233.jpg',
        'https://i.postimg.cc/T1fBZvJb/IMG-20250808-191253.jpg',
        'https://i.postimg.cc/Wz8xVY5H/IMG-20250808-191306.jpg',
        'https://i.postimg.cc/3rFs2W3F/IMG-20250808-191319.jpg',
        'https://i.postimg.cc/HsWfzHxD/IMG-20250808-191335.jpg',
        'https://i.postimg.cc/cHqpBnKX/IMG-20250810-184602.jpg'
    ],
    location: 'الخفجي 38 ورقلة',
    featured: false,
    ownerPhone: '+213666059583'
},
	{
    id: '3',
    offer: 'للبيع',
    name: 'منزل للبيع في سعيد عتبة',
    type: 'منزل',
    city: 'سعيد عتبة',
    price: '800 عطاو 700 والبيع قريب',
    area: '14م × 17م',
    document: 'عقد ملكية',
    bedrooms: 4,
    bathrooms: 2,
    description: '▪️ السعر: 800 عطاو 700 والبيع قريب ▪️ نوع العقار: منزل + قراج + حوش فيه نخلات ▪️ المساحة: 14م × 17م ▪️ الموقع: سعيد عتبة، ولاية ورقلة ▪️ الوثائق: عقد ملكية 📦 مكونات المنزل: • 4 غرف نوم • صالة • حوش واسع • قراج • خاصاتو فينيسيو',
    images: [
        'https://i.postimg.cc/XqHTzbMX/inbound2414151657360193587.jpg',
        'https://i.postimg.cc/pXyNnp8j/inbound4824391404964592563.jpg',
        'https://i.postimg.cc/kXH0NqFp/inbound8121804677791027239.jpg',
        'https://i.postimg.cc/dVTz4p5t/inbound8903199671399561353.jpg'
    ],
    location: 'سعيد عتبة ورقلة',
    featured: false,
    ownerPhone: '+213664818333'
},
{
    id: '4',
    offer: 'للبيع',
    name: 'أرض للبيع في سيدي خويلد',
    type: 'أرض',
    city: 'سيدي خويلد',
    price: 'عطاو 18,000 دج للمتر المربع',
    area: '1080 م²',
    document: 'دفتر عقاري',
    bedrooms: 0,
    bathrooms: 0,
    description: '▪️ السعر: عطاو 18,000 دج للمتر المربع ▪️ نوع العقار: أرض ▪️ المساحة: 1080 م² ▪️ الموقع: سيدي خويلد بورقلة، تبعد 300 متر عن الطريق الرئيسية المحاذية لسوبيرات عسيلة، بالقرب من شركة SNTP ▪️ الأبعاد: واجهة 21.6 م × عمق 50 م ▪️ الوثائق: دفتر عقاري',
    images: [
        'https://i.postimg.cc/3N0M4xb7/494834602-587549397301425-5016455081590852627-n.jpg',
        'https://i.postimg.cc/VknYZDg1/501534310-1222115952729452-6147086530063200898-n.jpg',
        'https://i.postimg.cc/NfrYLpWT/500317515-1727653531962753-6371530017780759445-n.jpg'
    ],
    location: 'سيدي خويلد بورقلة',
    featured: false,
    ownerPhone: '+213779056304'
},
{
    id: '5',
    offer: 'للبيع',
    name: 'منزل اف 4 للبيع في مخادمة',
    type: 'منزل',
    city: 'مخادمة',
    price: '700 مليون',
    area: 'متر مربع 73',
    document: 'دفتر عقاري',
    bedrooms: 4,
    bathrooms: 1,
    description: '▪️ السعر: 700 مليون ▪️ نوع العقار: منزل F4 ▪️ الطابق: الثالث ▪️ الموقع: حي 80 مسكن، مخادمة ▪️ الوثائق: دفتر عقاري',
    images: [
        'https://i.postimg.cc/nzykcFy6/528242973-695051300214432-8406529471947652869-n.jpg',
        'https://i.postimg.cc/kgYWgM8f/528258957-1602884467753832-5088219795999754715-n.jpg',
	    'https://i.postimg.cc/6qzybzfY/529471842-751715248025405-2990930107654313756-n.jpg',
	    'https://i.postimg.cc/GpY9nbjB/532130565-1837290517145518-3020732166450947190-n.jpg'
],
    location: 'حي 80 مسكن  مخادمة',
    featured: false,
    ownerPhone: '+213667329214'
},
	{
    id: '6',
    offer: 'للبيع',
    name: 'قطعة أرض للبيع في تجزئات سيدي جلول الرويسات',
    type: 'أرض',
    city: 'الرويسات',
    price: 'عطاو 250 مليون',
    area: '200 م²',
    document: 'دفتر عقاري',
    bedrooms: 0,
    bathrooms: 0,
    description: '▪️ السعر:عطاو 250 مليون ▪️ نوع العقار: قطعة أرض ▪️ المساحة: 200 م² ▪️ الموقع: تجزئات سيدي جلول، الرويسات ورقلة ▪️ المميزات: 3 واجهات ▪️ الوثائق: دفتر عقاري',
    images: [
        'https://i.postimg.cc/jjb5QGzy/IMG-20250813-WA0000.jpg',
        'https://i.postimg.cc/BnDbFq1q/IMG-20250813-WA0003.jpg',
        'https://i.postimg.cc/LX48GLQX/IMG-20250813-WA0004.jpg',
        'https://i.postimg.cc/Y0hqCkHB/IMG-20250813-WA0005.jpg',
        'https://i.postimg.cc/cHDLWCPc/IMG-20250813-WA0006.jpg',
        'https://i.postimg.cc/FKVKPDZ8/IMG-20250813-WA0006-1.jpg',
        'https://i.postimg.cc/NFSGyVs9/IMG-20250813-WA0007.jpg'
    ],
    location: 'سيدي جلول الرويسات ورقلة',
    featured: false,
    ownerPhone: '+213663171784'
},
    {
        id: '7',
		offer: 'للبيع',
        name: 'أرض سكنية للبيع',
        type: 'أرض',
        city: 'بامنديل',
        price: '300 دج',
        area: '192 متر مربع',
		document: 'عقد ملكية',
        bedrooms: 0,
        bathrooms: 0,
        description: 'المساحة: 192 مترالموقع: موقع استراتيجي هادئ ومناسب للسكن، قريبة جدًا من المسجد والمحلات التجارية الوثائق: عقد ملكية الفاص: 3 📌 موقع الأرض يجعلها مثالية لبناء منزل عائلي أو استثمار طويل المدى.📞 للاستفسار والتواصل مباشرة:0699908764',
        images: [
            'https://i.postimg.cc/wTZvJqT4/photo-2025-08-04-14-17-39.jpg',
			'https://i.postimg.cc/Zn1x1k4b/photo-2025-08-04-14-17-41.jpg',
			'https://i.postimg.cc/SjFcgWfj/photo-2025-08-04-14-17-38.jpg',
            'https://i.postimg.cc/GmDpxW4L/photo-2025-08-04-14-17-35.jpg'
        ],
        location: 'حي بامنديل',
        featured: true,
		ownerPhone: '+213540076713'
    }
];

// Categories data
const categories = [
    { id: 'apartment', name: 'شقق', icon: '🏠', count: 3 },
    { id: 'villa', name: 'فيلات', icon: '🏡', count: 3 },
    { id: 'shop', name: 'محلات', icon: '🏪', count: 1 },
    { id: 'land', name: 'أراضي', icon: '🌍', count: 2 },
    { id: 'office', name: 'مكاتب', icon: '🏢', count: 1 }
];

function trackViewProperty(property) {
  gtag('event', 'view_property', {
    property_id: property.id,
    type: property.type,
    city: property.city,
    price: property.price
  });
}

function trackAddToFavorites(property) {
  gtag('event', 'add_to_favorites', {
    property_id: property.id,
    city: property.city
  });
}




